src/Documents/ПриказОЗачислении/ПриказОЗачислении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОЗачислении</name>
  <registerRecords>InformationRegister.Учащиеся</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Студенты</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Староста</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>EnumRef.ФормаОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОбучения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ФормаОбучения/ФормаОбучения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФормаОбучения</name>
  <enumValues>
    <name>Бюджет</name>
  </enumValues>
  <enumValues>
    <name>Платное</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПриказОЗачислении/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСтуденты

&НаКлиенте
Процедура СтудентыФормаОбученияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Студенты.ТекущиеДанные;
	ЭлементСуммаОбучения = Элементы.Студенты.ПодчиненныеЭлементы.СтудентыСуммаОбучения;
	
	Если ТекСтрока.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.Бюджет") Тогда
	
		ТекСтрока.СуммаОбучения = 0;
		ЭлементСуммаОбучения.Доступность = Ложь;
		
	Иначе
		
		ЭлементСуммаОбучения.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
